#### [infrastructure/][stage] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform
module.ui.azurerm_app_service.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage]
module.ui.azurerm_dns_txt_record.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Network/dnszones/timetrackerapp.stage.ioet.com/TXT/asuid.ui.timetrackerapp.stage.ioet.com]
module.ui.azurerm_dns_cname_record.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Network/dnszones/timetrackerapp.stage.ioet.com/CNAME/ui]
module.ui.azurerm_app_service_custom_hostname_binding.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com]
module.ui.azurerm_app_service_managed_certificate.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com]
module.ui.azurerm_app_service_certificate_binding.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com|/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ui.azurerm_app_service.this has changed
  ~ resource "azurerm_app_service" "this" {
        id                                = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage"
        name                              = "time-tracker-service-stage"
      + tags                              = {}
        # (17 unchanged attributes hidden)



      ~ site_config {
          + default_documents                    = []
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ui.azurerm_app_service_custom_hostname_binding.this has changed
  ~ resource "azurerm_app_service_custom_hostname_binding" "this" {
        id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com"
      + ssl_state           = "SniEnabled"
      + thumbprint          = "9019488A1117E5219D5F730DEDBBD3CEE22DE645"
        # (3 unchanged attributes hidden)
    }

  # module.ui.azurerm_app_service_managed_certificate.this has changed
  ~ resource "azurerm_app_service_managed_certificate" "this" {
        id                         = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com"
      + tags                       = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ui.azurerm_app_service.this must be replaced
-/+ resource "azurerm_app_service" "this" {
      ~ client_cert_mode                  = "Required" -> (known after apply)
      ~ custom_domain_verification_id     = "6784E371282F6FC9E447605B5866C8A4C84A68F35143F3567B8CAA10F78A43D4" -> (known after apply)
      ~ default_site_hostname             = "time-tracker-service-stage.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ name                              = "time-tracker-service-stage" -> "time-tracker-service-stage-ui" # forces replacement
      ~ outbound_ip_address_list          = [
          - "40.118.227.215",
          - "40.118.231.14",
          - "13.64.101.180",
          - "104.42.56.180",
          - "40.118.225.130",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "40.118.227.215,40.118.231.14,13.64.101.180,104.42.56.180,40.118.225.130" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "40.112.243.46",
          - "40.118.230.174",
          - "104.42.150.243",
          - "40.118.225.132",
          - "40.112.135.83",
          - "40.118.227.215",
          - "40.118.231.14",
          - "13.64.101.180",
          - "104.42.56.180",
          - "40.118.225.130",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "40.112.243.46,40.118.230.174,104.42.150.243,40.118.225.132,40.112.135.83,40.118.227.215,40.118.231.14,13.64.101.180,104.42.56.180,40.118.225.130" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "hZQmBirJWyaKRnsAPLnCTsrtGZPjChbZxsohazTYfM1gYe0RXRMqqSqkykf5"
              - username = "$time-tracker-service-stage"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (8 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          - acr_user_managed_identity_client_id  = "" -> null
          - app_command_line                     = "" -> null
          - auto_swap_slot_name                  = "" -> null
          - default_documents                    = [] -> null
          ~ ftps_state                           = "AllAllowed" -> (known after apply)
          - health_check_path                    = "" -> null
          ~ ip_restriction                       = [] -> (known after apply)
          - java_container                       = "" -> null
          - java_container_version               = "" -> null
          - java_version                         = "" -> null
          ~ linux_fx_version                     = (sensitive)
          ~ local_mysql_enabled                  = false -> (known after apply)
          ~ managed_pipeline_mode                = "Integrated" -> (known after apply)
          ~ min_tls_version                      = "1.2" -> (known after apply)
          ~ number_of_workers                    = 1 -> (known after apply)
          - php_version                          = "" -> null
          - python_version                       = "" -> null
          ~ remote_debugging_version             = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                   = [] -> (known after apply)
          ~ scm_type                             = "None" -> (known after apply)
          - use_32_bit_worker_process            = false -> null
          ~ vnet_route_all_enabled               = false -> (known after apply)
          ~ websockets_enabled                   = false -> (known after apply)
          ~ windows_fx_version                   = "" -> (known after apply)
            # (6 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.ui.azurerm_app_service_certificate_binding.this must be replaced
-/+ resource "azurerm_app_service_certificate_binding" "this" {
      ~ app_service_name    = "time-tracker-service-stage" -> (known after apply)
      ~ certificate_id      = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com" -> (known after apply) # forces replacement
      ~ hostname            = "ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      ~ hostname_binding_id = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com" -> (known after apply) # forces replacement
      ~ id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com|/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      ~ thumbprint          = "9019488A1117E5219D5F730DEDBBD3CEE22DE645" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ui.azurerm_app_service_custom_hostname_binding.this must be replaced
-/+ resource "azurerm_app_service_custom_hostname_binding" "this" {
      ~ app_service_name    = "time-tracker-service-stage" -> "time-tracker-service-stage-ui" # forces replacement
      ~ id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      ~ ssl_state           = "SniEnabled" -> (known after apply)
      ~ thumbprint          = "9019488A1117E5219D5F730DEDBBD3CEE22DE645" -> (known after apply)
      + virtual_ip          = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ui.azurerm_app_service_managed_certificate.this must be replaced
-/+ resource "azurerm_app_service_managed_certificate" "this" {
      ~ canonical_name             = "ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      ~ custom_hostname_binding_id = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-service-stage/hostNameBindings/ui.timetrackerapp.stage.ioet.com" -> (known after apply) # forces replacement
      ~ expiration_date            = "2023-02-18T23:59:59Z" -> (known after apply)
      + friendly_name              = (known after apply)
      ~ host_names                 = [
          - "ui.timetrackerapp.stage.ioet.com",
        ] -> (known after apply)
      ~ id                         = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/certificates/ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      ~ issue_date                 = "2022-08-18T00:00:00Z" -> (known after apply)
      ~ issuer                     = "GeoTrust Global TLS RSA4096 SHA256 2022 CA1" -> (known after apply)
      ~ subject_name               = "ui.timetrackerapp.stage.ioet.com" -> (known after apply)
      - tags                       = {} -> null
      ~ thumbprint                 = "9019488A1117E5219D5F730DEDBBD3CEE22DE645" -> (known after apply)
    }

  # module.ui.azurerm_dns_cname_record.this will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Network/dnszones/timetrackerapp.stage.ioet.com/CNAME/ui"
        name                = "ui"
      ~ record              = "time-tracker-service-stage.azurewebsites.net" -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.ui.azurerm_dns_txt_record.this will be updated in-place
  ~ resource "azurerm_dns_txt_record" "this" {
        id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Network/dnszones/timetrackerapp.stage.ioet.com/TXT/asuid.ui.timetrackerapp.stage.ioet.com"
        name                = "asuid.ui.timetrackerapp.stage.ioet.com"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "6784E371282F6FC9E447605B5866C8A4C84A68F35143F3567B8CAA10F78A43D4" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @abigailscl, Action: `pull_request`*